#### Terraform Plan

<details><summary>Show Plan</summary>

```

terraform
Terraform used the selected providers to generate the following executionplan. Resource actions are indicated with the following symbols:  + createTerraform will perform the following actions:  # aws_eip.eip will be created  + resource "aws_eip" "eip" {      + allocation_id        = (known after apply)      + association_id       = (known after apply)      + carrier_ip           = (known after apply)      + customer_owned_ip    = (known after apply)      + domain               = (known after apply)      + id                   = (known after apply)      + instance             = (known after apply)      + network_border_group = (known after apply)      + network_interface    = (known after apply)      + private_dns          = (known after apply)      + private_ip           = (known after apply)      + public_dns           = (known after apply)      + public_ip            = (known after apply)      + public_ipv4_pool     = (known after apply)      + tags_all             = (known after apply)      + vpc                  = true    }  # aws_instance.example_vm will be created  + resource "aws_instance" "example_vm" {      + ami                                  = "ami-03248a0341eadb1f1"      + arn                                  = (known after apply)      + associate_public_ip_address          = (known after apply)      + availability_zone                    = (known after apply)      + cpu_core_count                       = (known after apply)      + cpu_threads_per_core                 = (known after apply)      + disable_api_termination              = (known after apply)      + ebs_optimized                        = (known after apply)      + get_password_data                    = false      + host_id                              = (known after apply)      + id                                   = (known after apply)      + instance_initiated_shutdown_behavior = (known after apply)      + instance_state                       = (known after apply)      + instance_type                        = "t2.micro"      + ipv6_address_count                   = (known after apply)      + ipv6_addresses                       = (known after apply)      + key_name                             = (known after apply)      + monitoring                           = (known after apply)      + outpost_arn                          = (known after apply)      + password_data                        = (known after apply)      + placement_group                      = (known after apply)      + placement_partition_number           = (known after apply)      + primary_network_interface_id         = (known after apply)      + private_dns                          = (known after apply)      + private_ip                           = (known after apply)      + public_dns                           = (known after apply)      + public_ip                            = (known after apply)      + secondary_private_ips                = (known after apply)      + security_groups                      = (known after apply)      + source_dest_check                    = true      + subnet_id                            = (known after apply)      + tags                                 = {          + "Name" = "cloudify-public-example-vm"        }      + tags_all                             = {          + "Name" = "cloudify-public-example-vm"        }      + tenancy                              = (known after apply)      + user_data                            = "44679306a7bbc836facc22d29b553dd18cffad31"      + user_data_base64                     = (known after apply)      + vpc_security_group_ids               = (known after apply)      + capacity_reservation_specification {          + capacity_reservation_preference = (known after apply)          + capacity_reservation_target {              + capacity_reservation_id = (known after apply)            }        }      + ebs_block_device {          + delete_on_termination = (known after apply)          + device_name           = (known after apply)          + encrypted             = (known after apply)          + iops                  = (known after apply)          + kms_key_id            = (known after apply)          + snapshot_id           = (known after apply)          + tags                  = (known after apply)          + throughput            = (known after apply)          + volume_id             = (known after apply)          + volume_size           = (known after apply)          + volume_type           = (known after apply)        }      + enclave_options {          + enabled = (known after apply)        }      + ephemeral_block_device {          + device_name  = (known after apply)          + no_device    = (known after apply)          + virtual_name = (known after apply)        }      + metadata_options {          + http_endpoint               = (known after apply)          + http_put_response_hop_limit = (known after apply)          + http_tokens                 = (known after apply)          + instance_metadata_tags      = (known after apply)        }      + network_interface {          + delete_on_termination = (known after apply)          + device_index          = (known after apply)          + network_interface_id  = (known after apply)        }      + root_block_device {          + delete_on_termination = (known after apply)          + device_name           = (known after apply)          + encrypted             = (known after apply)          + iops                  = (known after apply)          + kms_key_id            = (known after apply)          + tags                  = (known after apply)          + throughput            = (known after apply)          + volume_id             = (known after apply)          + volume_size           = (known after apply)          + volume_type           = (known after apply)        }    }  # module.vpc.aws_internet_gateway.example_gateway will be created  + resource "aws_internet_gateway" "example_gateway" {      + arn      = (known after apply)      + id       = (known after apply)      + owner_id = (known after apply)      + tags_all = (known after apply)      + vpc_id   = (known after apply)    }  # module.vpc.aws_route.example_route will be created  + resource "aws_route" "example_route" {      + destination_cidr_block = "0.0.0.0/0"      + gateway_id             = (known after apply)      + id                     = (known after apply)      + instance_id            = (known after apply)      + instance_owner_id      = (known after apply)      + network_interface_id   = (known after apply)      + origin                 = (known after apply)      + route_table_id         = (known after apply)      + state                  = (known after apply)    }  # module.vpc.aws_security_group.example_security_group will be created  + resource "aws_security_group" "example_security_group" {      + arn                    = (known after apply)      + description            = "Security group for example application"      + egress                 = [          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 0              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "-1"              + security_groups  = []              + self             = false              + to_port          = 0            },        ]      + id                     = (known after apply)      + ingress                = [          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 22              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "tcp"              + security_groups  = []              + self             = false              + to_port          = 22            },          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 2375              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "tcp"              + security_groups  = []              + self             = false              + to_port          = 2375            },          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 4566              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "tcp"              + security_groups  = []              + self             = false              + to_port          = 4566            },          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 4571              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "tcp"              + security_groups  = []              + self             = false              + to_port          = 4571            },          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 8080              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "tcp"              + security_groups  = []              + self             = false              + to_port          = 8080            },          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 80              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "tcp"              + security_groups  = []              + self             = false              + to_port          = 80            },          + {              + cidr_blocks      = [                  + "0.0.0.0/0",                ]              + description      = ""              + from_port        = 9990              + ipv6_cidr_blocks = []              + prefix_list_ids  = []              + protocol         = "tcp"              + security_groups  = []              + self             = false              + to_port          = 9990            },        ]      + name                   = "example_security_group"      + name_prefix            = (known after apply)      + owner_id               = (known after apply)      + revoke_rules_on_delete = false      + tags_all               = (known after apply)      + vpc_id                 = (known after apply)    }  # module.vpc.aws_subnet.example_subnet will be created  + resource "aws_subnet" "example_subnet" {      + arn                                            = (known after apply)      + assign_ipv6_address_on_creation                = false      + availability_zone                              = "us-east-1a"      + availability_zone_id                           = (known after apply)      + cidr_block                                     = "10.10.4.0/24"      + enable_dns64                                   = false      + enable_resource_name_dns_a_record_on_launch    = false      + enable_resource_name_dns_aaaa_record_on_launch = false      + id                                             = (known after apply)      + ipv6_cidr_block_association_id                 = (known after apply)      + ipv6_native                                    = false      + map_public_ip_on_launch                        = false      + owner_id                                       = (known after apply)      + private_dns_hostname_type_on_launch            = (known after apply)      + tags_all                                       = (known after apply)      + vpc_id                                         = (known after apply)    }  # module.vpc.aws_vpc.example_vpc will be created  + resource "aws_vpc" "example_vpc" {      + arn                                  = (known after apply)      + cidr_block                           = "10.10.0.0/16"      + default_network_acl_id               = (known after apply)      + default_route_table_id               = (known after apply)      + default_security_group_id            = (known after apply)      + dhcp_options_id                      = (known after apply)      + enable_classiclink                   = (known after apply)      + enable_classiclink_dns_support       = (known after apply)      + enable_dns_hostnames                 = true      + enable_dns_support                   = true      + id                                   = (known after apply)      + instance_tenancy                     = "default"      + ipv6_association_id                  = (known after apply)      + ipv6_cidr_block                      = (known after apply)      + ipv6_cidr_block_network_border_group = (known after apply)      + main_route_table_id                  = (known after apply)      + owner_id                             = (known after apply)      + tags_all                             = (known after apply)    }Plan: 7 to add, 0 to change, 0 to destroy.Changes to Outputs:  + ip = (known after apply)
```

</details>

*Pusher: @ahmadiesa-abu, Action: `issue_comment`*